Revit 2027 API
PanelScheduleTemplate.CopyFrom Method
 Copies all values from other element to this object.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void CopyFrom(
	Document OtherADoc,
	PanelScheduleTemplate otherElem
)
Public Sub CopyFrom (
	OtherADoc As Document,
	otherElem As PanelScheduleTemplate
)
public:
void CopyFrom(
	Document^ OtherADoc,
	PanelScheduleTemplate^ otherElem
)
member CopyFrom :
        OtherADoc : Document *
        otherElem : PanelScheduleTemplate -> unit
Parameters
OtherADoc Document
 The Document for the otherElem
otherElem PanelScheduleTemplate
 The element being copied from.
Exceptions
Exception | Condition
ArgumentException |  The given template otherElem has different type of this element.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PanelScheduleTemplate Class
Autodesk.Revit.DB.Electrical Namespace